google.charts.load("current", { packages: ["corechart"] });
google.charts.setOnLoadCallback(drawChart);

function drawChart() {
    var data = google.visualization.arrayToDataTable([
        ['กระทรวง', 'งบประมาณ'],
        ['กระทรวงเกษตรและสหกรณ์', 4266453200],
        ['กระทรวงแรงงาน', 19468400],
        ['กระทรวงกลาโหม', 171160700],
        ['กระทรวงการคลัง', 405524300],
        ['กระทรวงการต่างประเทศ', 1547700],
        ['กระทรวงการท่องเที่ยวและกีฬา', 48176300],
        ['กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์', 12961500],
        ['กระทรวงคมนาคม', 8290134300],
        ['กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม', 14587700],
        ['กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม', 543980450],
        ['กระทรวงพลังงาน', 7803100],
        ['กระทรวงพาณิชย์', 4514400],
        ['กระทรวงมหาดไทย', 2259280900],
        ['กระทรวงยุติธรรม', 316778600],
        ['กระทรวงวัฒนธรรม', 83822000],
        ['กระทรวงวิทยาศาสตร์และเทคโนโลยี', 598743100],
        ['กระทรวงศึกษาธิการ', 4395796869],
        ['กระทรวงสาธารณสุข', 708362500],
        ['กระทรวงอุตสาหกรรม', 989900],
        ['กองทุนและเงินทุนหมุนเวียน', 1024000],
        ['จังหวัดและกลุ่มจังหวัด', 1443057400],
        ['รัฐวิสาหกิจ', 564656600],
        ['ส่วนราชการไม่สังกัดสำนักนายกรัฐมนตรี กระทรวง หรือทบวง และหน่วยงานภายใต้การควบคุมดูแลของนายกรัฐมนตรี', 239222200],
        ['สำนักนายกรัฐมนตรี', 21091900],
        ['หน่วยงานขององค์กรอิสระและองค์กรอัยการ', 42894600],
    ]);

    var options = {
        title: 'งบประมาณแบ่งตามกระทรวง',
        pieHole: 0.5
    };

    data.sort([{ column: 1 }]);

    var chart = new google.visualization.PieChart(document.getElementById('ministry_pie'));
    chart.draw(data, options);
}