google.charts.load("current", { packages: ["corechart"] });
google.charts.setOnLoadCallback(drawChart);

function drawChart() {
    var data = google.visualization.arrayToDataTable([
        ['แผนงาน','งบประมาณ'],
        ['แผนงานบูรณาการพัฒนาด้านคมนาคมและระบบโลจิสติกส์',4421321800],
        ['แผนงานบูรณาการบริหารจัดการทรัพยากรน้ำ',4013933900],
        ['แผนงานยุทธศาสตร์พัฒนาการศึกษาเพื่อความยั่งยืน',2579650800],
        ['แผนงานพื้นฐานด้านการสร้างความสามารถในการแข่งขันของประเทศ',2374870000],
        ['แผนงานบูรณาการพัฒนาพื้นที่เขตเศรษฐกิจพิเศษ',2116021200],
        ['แผนงานบูรณาการส่งเสริมการพัฒนาจังหวัดและกลุ่มจังหวัดแบบบูรณาการ',1443057400],
        ['แผนงานบูรณาการส่งเสริมการกระจายอำนาจให้แก่องค์กรปกครองส่วนท้องถื่น',1399815900],
        ['แผนงานพื้นฐานด้านการพัฒนาและเสริมสร้างศักยภาพคน',1383499600],
        ['แผนงานยุทธศาสตร์สร้างเสริมให้คนมีสุขภาวะที่ดี',1007546900],
        ['แผนงานยุทธศาสตร์สร้างความมั่นคงและลดความเหลื่อมล้ำทางด้านเศรษฐกิจและสังคม',990736000],
        ['แผนงานบูรณาการพัฒนาพื้นที่ระดับภาค',631545300],
        ['แผนงานบุคลากรภาครัฐ (ด้านการพัฒนาและเสริมสร้างศักยภาพคน)',375572700],
        ['แผนงานยุทธศาสตร์พัฒนาประสิทธิภาพการบริหารราชการแผ่นดิน',354298800],
        ['แผนงานยุทธศาสตร์พัฒนาศักยภาพด้านวิทยาศาสตร์ เทคโนโลยี และนวัตกรรม',229459100],
        ['แผนงานยุทธศาสตร์จัดระบบอนุรักษ์ ฟื้นฟู และป้องกันการทำลายทรัพยากรธรรมชาติ',225899850],
        ['แผนงานพื้นฐานด้านการจัดการน้ำและสร้างการเติบโตบนคุณภาพชีวิตที่เป็นมิตรกับสิ่งแวดล้อมอย่างยั่งยืน',157420500],
        ['แผนงานบูรณาการพัฒนาศักยภาพคนตลอดช่วงชีวิต',152835600],
        ['แผนงานยุทธศาสตร์เสริมสร้างศักยภาพการป้องกันประเทศ',119340200],
        ['แผนงานพื้นฐานด้านการปรับสมดุลและพัฒนาระบบบริหารจัดการภาครัฐ',76910900],
        ['แผนงานบูรณาการวิจัยและนวัตกรรม',67970200],
        ['แผนงานพื้นฐานด้านความมั่นคง',60861700],
        ['แผนงานบูรณาการสร้างรายได้จากการท่องเที่ยว กีฬา และวัฒนธรรม',59263900],
        ['แผนงานยุทธศาสตร์สร้างความเข้มแข็งของสถาบันทางสังคม ทุนทางวัฒนธรรม และชุมชน',33500200],
        ['แผนงานยุทธศาสตร์เสริมสร้างความมั่นคงของสถาบันหลักของชาติ',29747800],
        ['แผนงานบูรณาการพัฒนาศักยภาพการผลิตภาคการเกษตร',29075300],
        ['แผนงานพื้นฐานด้านการแก้ไขปัญหาความยากจน ลดความเหลื่อมล้ำ และสร้างการเติบโตจากภายใน',27778200],
        ['แผนงานยุทธศาสตร์บริหารจัดการรายได้และรายจ่ายของภาครัฐ',26608700],
        ['แผนงานยุทธศาสตร์จัดการผลกระทบจากการเปลี่ยนแปลงสภาวะภูมิอากาศ',20000000],
        ['แผนงานยุทธศาสตร์พัฒนาระบบการเตรียมพร้อมแห่งชาติและระบบบริหารจัดการภัยพิบัติ',12900000],
        ['แผนงานบูรณาการจัดการปัญหาแรงงานต่างด้าวและการค้ามนุษย์',9098700],
        ['แผนงานบูรณาการป้องกัน ปราบปราม และบำบัดรักษาผู้ติดยาเสพติด',6159369],
        ['แผนงานบูรณาการยกระดับคุณภาพการศึกษาและการเรียนรู้ให้มีคุณภาพ เท่าเทียมและทั่วถึง',4777000],
        ['แผนงานบูรณาการต่อต้านการทุจริตและประพฤติมิชอบ',4749000],
        ['แผนงานยุทธศาสตร์ส่งเสริมความสัมพันธ์ระหว่างประเทศด้านความมั่นคง',4204000],
        ['แผนงานบูรณาการพัฒนาเศรษฐกิจและสังคมดิจิทัล',3207500],
        ['แผนงานบูรณาการพัฒนาผู้ประกอบการ เศรษฐกิจชุมชน และวิสาหกิจขนาดกลางและขนาดย่อมสู่สากล',2665500],
        ['แผนงานยุทธศาสตร์ปรับกระบวนการทำงานของกลไกที่เกี่ยวข้องด้านความมั่นคงจากแนวดิ่งสู่แนวราบ',2000000],
        ['แผนงานยุทธศาสตร์พัฒนาความเชื่อมโยงกับภูมิภาคและเศรษฐกิจโลก และสร้างความเป็นหุ้นส่วนการพัฒนากับนานาประเทศ',1547700],
        ['แผนงานยุทธศาสตร์พัฒนาประสิทธิภาพและมูลค่าเพิ่มของภาคการผลิต บริการ การค้า และการลงทุน',1151400],
        ['แผนงานบูรณาการพัฒนาเมืองอุตสาหกรรมเชิงนิเวศ และการจัดการมลพิษและสิ่งแวดล้อม',1030000]
    ]);

    var options = {
        title: 'งบประมาณแบ่งตามแผนงาน',
        pieHole: 0.5,
        width: 900,
        height: 500
    };

    data.sort([{ column: 1 }]);

    var chart = new google.visualization.PieChart(document.getElementById('project_pie'));
    chart.draw(data, options);
}