google.charts.load('current', {'packages':['table']});
      google.charts.setOnLoadCallback(drawTable);

      function drawTable() {
        var data = new google.visualization.DataTable();
        data.addColumn('string', 'แผนงาน');
        data.addColumn('number', 'งบประมาณ(บาท)');

        data.addRows([
            ['แผนงานบุคลากรภาครัฐ',4385702500],
            ['แผนงานยุทธศาสตร์พัฒนาการศึกษาเพื่อความยั่งยืน',2165846400],
            ['แผนงานพื้นฐานด้านการพัฒนาและเสริมสร้างศักยภาพคน',1192213520],
            ['แผนงานยุทธศาสตร์์ส่งเสริมให้คนมีสุขภาวะที่ดี',743577200],
            ['แผนงานบูรณาการวิจัยและนวัตกรรม',276788000],
            ['แผนงานบูรณาการพัฒนาเศรษฐกิจและสังคม',145939300],
            ['แผนงานบูรณาการพัฒนาพท้นที่ระดับภาค',17527500],
            ['แผนงานบูรณาการยกระดับคุณ ภาพการศึกษาและการเรียนรู้ให้มีคุณ ภาพเท่าเทียมและทั่วถึง',3648800],
            ['แผนงานบูรณาการป้องกัน ปราบปราม และบำบัดรักษาผู้ติดยาเสพติด',3595157],
            ['แผนงานบูรณาการต่อต้านการทุจริตและประพฤติมิชอบ',2162000],
            ['แผนงานบูรณาการพัฒนาเมืองอุตสาหกรรมเชิงนิเวศและการจัดการมลพิษและสิ่งแวดล้อม',1751000],
        ]);

        var table = new google.visualization.Table(document.getElementById('project_table'));

        table.draw(data, {showRowNumber: true, width: '100%', height: '100%'});
      }